package com.util;



/**
 * 返回的消息状态码说明
 * 
 *@author FFFF
 * Put
 * undefined
 * The's Not me want.
 * insert in
 * angel
 * nice
 * 2016年10月12日
 */
public class MessagesCode {
	
	/*
	int 0 = "成功";
	
	int 1 = "失败（客户端导致的失败）";
	
	int 2 = "失败（服务端导致的失败）";
	
	1、在给客户端返回的时候请注意次状态码说明类
	2、此类并无实际意义，只是用来说明返回状态码的含义。
	3、返回的状态码均为int类型，请注意不要失误弄成String类型。
	4、如有其他疑问请联系码主。
		
		注：上面是说明状态码所表示意思。
	*/
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	/**
	 * 能看到这里，说明你也是一个充满好奇心的骚年。
	 * 善于发现某些被刻意隐藏起来的东西，ok，接下来我要告诉你一个重要的秘密。你准备好去揭秘了吗？
	 *          
	 *             
	 *           
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             
	 *             /'~~~~~~~\|/
	 *	         ,/'     ____ `\
	 *		    |   ,,__/    '| \
	 *		   ,|_./___   ___ |  |
	 *		    |-(  .)-(.  )`|,'
	 *		   (|  ~~~   ~~~   |)
	 *		    |     `-'      |'
	 *		     \   ,____,   /
	 *		      \   `--'   /
	 *		       |\______/|
	 *		      |\________/|
	 *		      \----------/
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 如果你的英语不是太烂，应该很快就看懂了。不妨先运行试试？
	 */
	public  void thisCompanyIs(){
		String[] arr = new String[]{"Put","undefined","The's Not me want","insert in","angel","nice"};
		
		for(int i = 0;i <= arr.length-1;i++){
			String aa = arr[i];
			String bb = aa.substring(0, 1);
			System.out.print(bb);
		}
	}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
